#include <stdio.h>

double getPrize(double x);

int main()
{
    double x;

    scanf("%lf", &x);
    printf("The prize is %.4f.\n", getPrize(x));

    return 0;
}

// 利润低于或等于10万元时，奖金可提10%；
// 利润在10万与20万之间时，高于10万元的部分，可提成7.5%；
// 利润在20万到40万之间时，高于20万元的部分，可提成5%；
// 利润在40万到60万之间时，高于40万元的部分，可提成3%；
// 利润在60万到100万之间时，高于60万元的部分，可提成1.5%；
// 利润高于100万元时，高于100万的部分按1%提成

double getPrize(double x)
{
    double a = 0;
    if (x <= 10)
        a = x * 0.1;
    else if (10 < x && x <= 20)
        a = 10 * 0.1 + (x - 10) * 0.075;
    else if (20 < x && x <= 40)
        a = 10 * (0.1 + 0.075) + (x - 20) * 0.05;
    else if (40 < x && x <= 60)
        a = 10 * (0.1 + 0.075) + 20 * 0.05 + (x - 40) * 0.03;
    else if (60 < x && x <= 100)
        a = 10 * (0.1 + 0.075) + 20 * (0.05 + 0.03) + (x - 60) * 0.015;
    else if (100 < x)
        a = 10 * (0.1 + 0.075) + 20 * (0.05 + 0.03) + 40 * 0.015 + (x - 100) * 0.01;
    return a;
}